In [1]:
%pip install ipython-sql
%load_ext sql

# Connect to SQLite database
%sql sqlite:///library.db

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.12/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (3.17.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (2.0.44)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (0.5.4)
Requirement already satisfied: six in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet>=1 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.15.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (75.2.0)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (3.0.52)
Requirement already satisfied: pygments in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: backcall in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.2.1)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.12/dist-packages (from prettytable->ipython-sql) (0.2.14)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/local/lib/python3.12/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.12/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Downloading jedi-0.19.2-py2.py3-none-any.whl (1.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 18.2 MB/s eta 0:00:00
Installing collected packages: jedi
Successfully installed jedi-0.19.2

In [2]:
import prettytable

# Create a fallback DEFAULT style so ipython-sql stops crashing
prettytable.DEFAULT = prettytable.MARKDOWN

/tmp/ipython-input-1086670285.py:4: DeprecationWarning: the 'MARKDOWN' constant is deprecated, use the 'TableStyle' enum instead
  prettytable.DEFAULT = prettytable.MARKDOWN

In [3]:
#TASK_1
%%sql

DROP TABLE IF EXISTS Loans;
DROP TABLE IF EXISTS Books;
DROP TABLE IF EXISTS Members;

-- CREATE TABLE: Members
CREATE TABLE Members (
    member_id INT PRIMARY KEY,
    name VARCHAR(100),
    email VARCHAR(100) UNIQUE,
    join_date DATE
);

-- CREATE TABLE: Books
CREATE TABLE Books (
    book_id INT PRIMARY KEY,
    title VARCHAR(200),
    author VARCHAR(100),
    available BOOLEAN
);

-- CREATE TABLE: Loans
CREATE TABLE Loans (
    loan_id INT PRIMARY KEY,
    member_id INT,
    book_id INT,
    loan_date DATE,
    return_date DATE,
    FOREIGN KEY (member_id) REFERENCES Members(member_id),
    FOREIGN KEY (book_id) REFERENCES Books(book_id)
);

 * sqlite:///library.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [4]:
%load_ext sql
%sql sqlite:///library.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%%sql
SELECT name AS table_name
FROM sqlite_master
WHERE type = 'table'
ORDER BY name;

 * sqlite:///library.db
Done.

[('Books',), ('Loans',), ('Members',)]

In [6]:
%%sql
PRAGMA table_info(Members);

 * sqlite:///library.db
Done.

[(0, 'member_id', 'INT', 0, None, 1),
 (1, 'name', 'VARCHAR(100)', 0, None, 0),
 (2, 'email', 'VARCHAR(100)', 0, None, 0),
 (3, 'join_date', 'DATE', 0, None, 0)]

In [7]:
%load_ext sql
%sql sqlite:///library.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [8]:
%%sql
DELETE FROM Loans;
DELETE FROM Books;
DELETE FROM Members;

-- Reset auto-increment counters (SQLite)
DELETE FROM sqlite_sequence;

 * sqlite:///library.db
0 rows affected.
0 rows affected.
0 rows affected.
(sqlite3.OperationalError) no such table: sqlite_sequence
[SQL: -- Reset auto-increment counters (SQLite)
DELETE FROM sqlite_sequence;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
#TASK-2
%%sql

INSERT OR REPLACE INTO Members (member_id, name, email, join_date) VALUES
(1, 'Siri', 'siri@gmail.com', '2025-11-01'),
(2, 'Nithya', 'nithya@gmail.com', '2025-11-02'),
(3, 'Shreya', 'shreya@gmail.com', '2025-11-03');

INSERT OR REPLACE INTO Books (book_id, title, author, available) VALUES
(101, 'Introduction to Databases', 'C.J. Date', TRUE),
(102, 'The Silent Patient', 'Alex Michaelides', TRUE),
(103, 'Clean Code', 'Robert C. Martin', TRUE);

INSERT OR REPLACE INTO Loans (loan_id, member_id, book_id, loan_date, return_date) VALUES
(1, 1, 101, '2025-11-01', NULL),
(2, 2, 102, '2025-11-02', '2025-12-25'),
(3, 3, 103, '2025-11-03', '2025-12-29');

 * sqlite:///library.db
3 rows affected.
3 rows affected.
3 rows affected.

[]

In [13]:
#TASK_3
%%sql
SELECT
    Members.name AS member_name,
    Books.book_id,
    Books.title,
    Books.author,
    Loans.loan_date,
    Loans.return_date
FROM Loans
JOIN Members ON Loans.member_id = Members.member_id
JOIN Books ON Loans.book_id = Books.book_id
WHERE Members.name = 'Siri';

 * sqlite:///library.db
Done.

[('Siri', 101, 'Introduction to Databases', 'C.J. Date', '2025-11-01', None)]

In [17]:
#TASK_4
%%sql
UPDATE Books
SET available = FALSE
WHERE book_id = 102;

 * sqlite:///library.db
1 rows affected.

[]

In [19]:
#TASK_4
%%sql
DELETE FROM Members
WHERE member_id = 2
AND member_id IN (
    SELECT member_id
    FROM Loans
    WHERE return_date IS '2025-12-25'
);

 * sqlite:///library.db
1 rows affected.

[]

In [20]:
#TASK_4
%%sql
SELECT * FROM Members;

 * sqlite:///library.db
Done.

[(3, 'Shreya', 'shreya@gmail.com', '2025-11-03')]

In [21]:
#TASK_4
%%sql
SELECT * FROM Loans;

 * sqlite:///library.db
Done.

[(2, 2, 102, '2025-11-02', '2025-12-25'),
 (3, 3, 103, '2025-11-03', '2025-12-29')]

In [22]:
#TASK_4
%%sql
select * from Books;

 * sqlite:///library.db
Done.

[(101, 'Introduction to Databases', 'C.J. Date', 0),
 (102, 'The Silent Patient', 'Alex Michaelides', 0),
 (103, 'Clean Code', 'Robert C. Martin', 1)]